In [1]:
import numpy as np
import pandas as pd

In [2]:
#creating series from List & numpy array
marks_list=[55,25,75,40,90]
marks_arr=np.array(marks_list)

series_list=pd.Series(marks_list)
series_arr=pd.Series(marks_arr)

print(series_list)
print(series_arr)

0    55
1    25
2    75
3    40
4    90
dtype: int64
0    55
1    25
2    75
3    40
4    90
dtype: int32

In [3]:
#changing the index of a series
labeled_series=pd.Series(marks_list,index=['A','B','C','D','E'])
labeled_series

A    55
B    25
C    75
D    40
E    90
dtype: int64

## Performing mathematical operations on Pandas series

In [4]:
labeled_updated=labeled_series+2.5
print(labeled_updated)

A    57.5
B    27.5
C    77.5
D    42.5
E    92.5
dtype: float64

In [5]:
print(labeled_updated-labeled_series)

A    2.5
B    2.5
C    2.5
D    2.5
E    2.5
dtype: float64

# Pandas Dataframe

## Creating a Pandas Dataframe using a list

In [9]:
student=['Mary','Peter','Susan','Toby','Vishal']
df1=pd.DataFrame(student,columns=['Student'])
df1

  Student
0    Mary
1   Peter
2   Susan
3    Toby
4  Vishal

In [10]:
student=pd.DataFrame(student,index=['A','B','C','D','E'],columns=['Student'])
student

  Student
A    Mary
B   Peter
C   Susan
D    Toby
E  Vishal

In [14]:
Student=['Mary','Peter','Susan','Toby','Vishal']
Grade=['B-','A+','A-','B+','C']
num=[10,11,12,13,14]
roll=[123,124,125,126,127]

Stu=pd.DataFrame({'Student':Student,'Grade':Grade,'num':num,'roll':roll})
Stu

  Student Grade  num  roll
0    Mary    B-   10   123
1   Peter    A+   11   124
2   Susan    A-   12   125
3    Toby    B+   13   126
4  Vishal     C   14   127

## Creating a Pandas DataFrame using Random values

In [19]:
arr=np.random.randint(1,100,10)
arr

array([ 6, 18, 69, 35, 40, 40, 71, 99, 97, 43])

In [16]:
df4=pd.DataFrame(np.random.randn(5,2),columns=['Column1','Column2'])
df4

    Column1   Column2
0  0.450480 -3.292187
1 -1.188638 -0.105455
2  0.878116 -0.808341
3  0.680407  0.242996
4  0.911342 -0.244423

In [23]:
df5=pd.DataFrame(np.random.randint(1,100,(10,2)),columns=['Column1','Column2'])
df5

   Column1  Column2
0       77       89
1       84       24
2        1       21
3       18       75
4        2       83
5       28       92
6       58       56
7       26       78
8       29        1
9       50       37

In [24]:
df5[:3]

   Column1  Column2
0       77       89
1       84       24
2        1       21

In [30]:
df5[::-1]

   Column1  Column2
9       50       37
8       29        1
7       26       78
6       58       56
5       28       92
4        2       83
3       18       75
2        1       21
1       84       24
0       77       89

In [40]:
df5['Column1'][1:2:]

1    84
Name: Column1, dtype: int32

In [41]:
Stu.iloc[1:4,1:4]

  Grade  num  roll
1    A+   11   124
2    A-   12   125
3    B+   13   126

In [46]:
Stu.loc[0:4,'Grade':'roll']

  Grade  num  roll
0    B-   10   123
1    A+   11   124
2    A-   12   125
3    B+   13   126
4     C   14   127

In [63]:
Stu.iloc[1:4,0:2]

  Student Grade
1   Peter    A+
2   Susan    A-
3    Toby    B+

In [59]:
new_df=Stu.copy()
new_df

  Student Grade  num  roll
0    Mary    B-   10   123
1   Peter    A+   11   124
2   Susan    A-   12   125
3    Toby    B+   13   126
4  Vishal     C   14   127

In [60]:
new_df.drop(['num'],axis=1,inplace=True)  # X column=>axis=1, Ycolumn=>axis=0

In [61]:
new_df

  Student Grade  roll
0    Mary    B-   123
1   Peter    A+   124
2   Susan    A-   125
3    Toby    B+   126
4  Vishal     C   127